MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1619/mcu.h
extern volatile PID1Z1Ubits_t PID1Z1Ubits __at(0x59D);
// bitfield macros
#define _PID1Z1U_PID1Z116_POSN                              0x0
#define _PID1Z1U_PID1Z116_POSITION                          0x0
#define _PID1Z1U_PID1Z116_SIZE                              0x1
#define _PID1Z1U_PID1Z116_LENGTH                            0x1
#define _PID1Z1U_PID1Z116_MASK                              0x1
#define _PID1Z1U_Z116_POSN                                  0x0
#define _PID1Z1U_Z116_POSITION                              0x0
#define _PID1Z1U_Z116_SIZE                                  0x1
#define _PID1Z1U_Z116_LENGTH                                0x1
#define _PID1Z1U_Z116_MASK                                  0x1

// Register: PID1Z2
#define PID1Z2 PID1Z2
#ifndef __CCI__
extern volatile __uint24                PID1Z2              __at(0x60C);
#endif
#ifndef _LIB_BUILD
asm("PID1Z2 equ 060Ch");
#endif

// Register: PID1Z2L
#define PID1Z2L PID1Z2L
extern volatile unsigned char           PID1Z2L             __at(0x60C);
#ifndef _LIB_BUILD
asm("PID1Z2L equ 060Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1Z20                :1;
        unsigned PID1Z21                :1;
        unsigned PID1Z22                :1;
        unsigned PID1Z23                :1;
        unsigned PID1Z24                :1;
        unsigned PID1Z25                :1;
        unsigned PID1Z26                :1;
        unsigned PID1Z27                :1;
    };
    struct {
        unsigned Z20                    :1;
        unsigned Z21                    :1;
        unsigned Z22                    :1;
        unsigned Z23                    :1;
        unsigned Z24                    :1;
        unsigned Z25                    :1;
        unsigned Z26                    :1;
        unsigned Z27                    :1;
    };
} PID1Z2Lbits_t;
extern volatile PID1Z2Lbits_t PID1Z2Lbits __at(0x60C);
// bitfield macros
#define _PID1Z2L_PID1Z20_POSN                               0x0
#define _PID1Z2L_PID1Z20_POSITION                           0x0
#define _PID1Z2L_PID1Z20_SIZE                               0x1
#define _PID1Z2L_PID1Z20_LENGTH                             0x1
#define _PID1Z2L_PID1Z20_MASK                               0x1
#define _PID1Z2L_PID1Z21_POSN                               0x1
#define _PID1Z2L_PID1Z21_POSITION                           0x1
#define _PID1Z2L_PID1Z21_SIZE                               0x1
#define _PID1Z2L_PID1Z21_LENGTH                             0x1
#define _PID1Z2L_PID1Z21_MASK                               0x2
#define _PID1Z2L_PID1Z22_POSN                               0x2
#define _PID1Z2L_PID1Z22_POSITION                           0x2
#define _PID1Z2L_PID1Z22_SIZE                               0x1
#define _PID1Z2L_PID1Z22_LENGTH                             0x1
#define _PID1Z2L_PID1Z22_MASK                               0x4
#define _PID1Z2L_PID1Z23_POSN                               0x3
#define _PID1Z2L_PID1Z23_POSITION                           0x3
#define _PID1Z2L_PID1Z23_SIZE                               0x1
#define _PID1Z2L_PID1Z23_LENGTH                             0x1
#define _PID1Z2L_PID1Z23_MASK                               0x8
#define _PID1Z2L_PID1Z24_POSN                               0x4
#define _PID1Z2L_PID1Z24_POSITION                           0x4
#define _PID1Z2L_PID1Z24_SIZE                               0x1
#define _PID1Z2L_PID1Z24_LENGTH                             0x1
#define _PID1Z2L_PID1Z24_MASK                               0x10
#define _PID1Z2L_PID1Z25_POSN                               0x5
#define _PID1Z2L_PID1Z25_POSITION                           0x5
#define _PID1Z2L_PID1Z25_SIZE                               0x1
#define _PID1Z2L_PID1Z25_LENGTH                             0x1
#define _PID1Z2L_PID1Z25_MASK                               0x20
#define _PID1Z2L_PID1Z26_POSN                               0x6
#define _PID1Z2L_PID1Z26_POSITION                           0x6
#define _PID1Z2L_PID1Z26_SIZE                               0x1
#define _PID1Z2L_PID1Z26_LENGTH                             0x1
#define _PID1Z2L_PID1Z26_MASK                               0x40
#define _PID1Z2L_PID1Z27_POSN                               0x7
#define _PID1Z2L_PID1Z27_POSITION                           0x7
#define _PID1Z2L_PID1Z27_SIZE                               0x1
#define _PID1Z2L_PID1Z27_LENGTH                             0x1
#define _PID1Z2L_PID1Z27_MASK                               0x80
#define _PID1Z2L_Z20_POSN                                   0x0
#define _PID1Z2L_Z20_POSITION                               0x0
#define _PID1Z2L_Z20_SIZE                                   0x1
#define _PID1Z2L_Z20_LENGTH                                 0x1
#define _PID1Z2L_Z20_MASK                                   0x1
#define _PID1Z2L_Z21_POSN                                   0x1
#define _PID1Z2L_Z21_POSITION                               0x1
#define _PID1Z2L_Z21_SIZE                                   0x1
#define _PID1Z2L_Z21_LENGTH                                 0x1
#define _PID1Z2L_Z21_MASK                                   0x2
#define _PID1Z2L_Z22_POSN                                   0x2
#define _PID1Z2L_Z22_POSITION                               0x2
#define _PID1Z2L_Z22_SIZE                                   0x1
#define _PID1Z2L_Z22_LENGTH                                 0x1
#define _PID1Z2L_Z22_MASK                                   0x4
#define _PID1Z2L_Z23_POSN                                   0x3
#define _PID1Z2L_Z23_POSITION                               0x3
#define _PID1Z2L_Z23_SIZE                                   0x1
#define _PID1Z2L_Z23_LENGTH                                 0x1
#define _PID1Z2L_Z23_MASK                                   0x8
#define _PID1Z2L_Z24_POSN                                   0x4
#define _PID1Z2L_Z24_POSITION                               0x4
#define _PID1Z2L_Z24_SIZE                                   0x1
#define _PID1Z2L_Z24_LENGTH                                 0x1
#define _PID1Z2L_Z24_MASK                                   0x10
#define _PID1Z2L_Z25_POSN                                   0x5
#define _PID1Z2L_Z25_POSITION                               0x5
#define _PID1Z2L_Z25_SIZE                                   0x1
#define _PID1Z2L_Z25_LENGTH                                 0x1
#define _PID1Z2L_Z25_MASK                                   0x20
#define _PID1Z2L_Z26_POSN                                   0x6
#define _PID1Z2L_Z26_POSITION                               0x6
#define _PID1Z2L_Z26_SIZE                                   0x1
#define _PID1Z2L_Z26_LENGTH                                 0x1
#define _PID1Z2L_Z26_MASK                                   0x40
#define _PID1Z2L_Z27_POSN                                   0x7
#define _PID1Z2L_Z27_POSITION                               0x7
#define _PID1Z2L_Z27_SIZE                                   0x1
#define _PID1Z2L_Z27_LENGTH                                 0x1
#define _PID1Z2L_Z27_MASK                                   0x80

// Register: PID1Z2H
#define PID1Z2H PID1Z2H
extern volatile unsigned char           PID1Z2H             __at(0x60D);
#ifndef _LIB_BUILD
asm("PID1Z2H equ 060Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1Z28                :1;
        unsigned PID1Z29                :1;
        unsigned PID1Z210               :1;
        unsigned PID1Z211               :1;
        unsigned PID1Z212               :1;
        unsigned PID1Z213               :1;
        unsigned PID1Z214               :1;
        unsigned PID1Z215               :1;
    };
    struct {
        unsigned Z28                    :1;
        unsigned Z29                    :1;
        unsigned Z210                   :1;
        unsigned Z211                   :1;
        unsigned Z212                   :1;
        unsigned Z213                   :1;
        unsigned Z214                   :1;
        unsigned Z215                   :1;
    };
} PID1Z2Hbits_t;
