MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1619/mcu.h
// Register: PID1ACCU
#define PID1ACCU PID1ACCU
extern volatile unsigned char           PID1ACCU            __at(0x613);
#ifndef _LIB_BUILD
asm("PID1ACCU equ 0613h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1ACC32              :1;
        unsigned PID1ACC33              :1;
        unsigned PID1ACC34              :1;
    };
    struct {
        unsigned ACC32                  :1;
        unsigned ACC33                  :1;
        unsigned ACC34                  :1;
    };
} PID1ACCUbits_t;
extern volatile PID1ACCUbits_t PID1ACCUbits __at(0x613);
// bitfield macros
#define _PID1ACCU_PID1ACC32_POSN                            0x0
#define _PID1ACCU_PID1ACC32_POSITION                        0x0
#define _PID1ACCU_PID1ACC32_SIZE                            0x1
#define _PID1ACCU_PID1ACC32_LENGTH                          0x1
#define _PID1ACCU_PID1ACC32_MASK                            0x1
#define _PID1ACCU_PID1ACC33_POSN                            0x1
#define _PID1ACCU_PID1ACC33_POSITION                        0x1
#define _PID1ACCU_PID1ACC33_SIZE                            0x1
#define _PID1ACCU_PID1ACC33_LENGTH                          0x1
#define _PID1ACCU_PID1ACC33_MASK                            0x2
#define _PID1ACCU_PID1ACC34_POSN                            0x2
#define _PID1ACCU_PID1ACC34_POSITION                        0x2
#define _PID1ACCU_PID1ACC34_SIZE                            0x1
#define _PID1ACCU_PID1ACC34_LENGTH                          0x1
#define _PID1ACCU_PID1ACC34_MASK                            0x4
#define _PID1ACCU_ACC32_POSN                                0x0
#define _PID1ACCU_ACC32_POSITION                            0x0
#define _PID1ACCU_ACC32_SIZE                                0x1
#define _PID1ACCU_ACC32_LENGTH                              0x1
#define _PID1ACCU_ACC32_MASK                                0x1
#define _PID1ACCU_ACC33_POSN                                0x1
#define _PID1ACCU_ACC33_POSITION                            0x1
#define _PID1ACCU_ACC33_SIZE                                0x1
#define _PID1ACCU_ACC33_LENGTH                              0x1
#define _PID1ACCU_ACC33_MASK                                0x2
#define _PID1ACCU_ACC34_POSN                                0x2
#define _PID1ACCU_ACC34_POSITION                            0x2
#define _PID1ACCU_ACC34_SIZE                                0x1
#define _PID1ACCU_ACC34_LENGTH                              0x1
#define _PID1ACCU_ACC34_MASK                                0x4

// Register: PID1CON
#define PID1CON PID1CON
extern volatile unsigned char           PID1CON             __at(0x614);
#ifndef _LIB_BUILD
asm("PID1CON equ 0614h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1MODE               :3;
        unsigned                        :3;
        unsigned PID1BUSY               :1;
        unsigned PID1EN                 :1;
    };
    struct {
        unsigned MODE                   :3;
        unsigned                        :3;
        unsigned BUSY                   :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
    struct {
        unsigned PID1MODE0              :1;
        unsigned PID1MODE1              :1;
        unsigned PID1MODE2              :1;
    };
} PID1CONbits_t;
extern volatile PID1CONbits_t PID1CONbits __at(0x614);
// bitfield macros
#define _PID1CON_PID1MODE_POSN                              0x0
#define _PID1CON_PID1MODE_POSITION                          0x0
#define _PID1CON_PID1MODE_SIZE                              0x3
#define _PID1CON_PID1MODE_LENGTH                            0x3
#define _PID1CON_PID1MODE_MASK                              0x7
#define _PID1CON_PID1BUSY_POSN                              0x6
#define _PID1CON_PID1BUSY_POSITION                          0x6
#define _PID1CON_PID1BUSY_SIZE                              0x1
#define _PID1CON_PID1BUSY_LENGTH                            0x1
#define _PID1CON_PID1BUSY_MASK                              0x40
#define _PID1CON_PID1EN_POSN                                0x7
#define _PID1CON_PID1EN_POSITION                            0x7
#define _PID1CON_PID1EN_SIZE                                0x1
#define _PID1CON_PID1EN_LENGTH                              0x1
#define _PID1CON_PID1EN_MASK                                0x80
#define _PID1CON_MODE_POSN                                  0x0
#define _PID1CON_MODE_POSITION                              0x0
#define _PID1CON_MODE_SIZE                                  0x3
#define _PID1CON_MODE_LENGTH                                0x3
#define _PID1CON_MODE_MASK                                  0x7
#define _PID1CON_BUSY_POSN                                  0x6
#define _PID1CON_BUSY_POSITION                              0x6
#define _PID1CON_BUSY_SIZE                                  0x1
#define _PID1CON_BUSY_LENGTH                                0x1
#define _PID1CON_BUSY_MASK                                  0x40
#define _PID1CON_EN_POSN                                    0x7
#define _PID1CON_EN_POSITION                                0x7
#define _PID1CON_EN_SIZE                                    0x1
#define _PID1CON_EN_LENGTH                                  0x1
#define _PID1CON_EN_MASK                                    0x80
#define _PID1CON_MODE0_POSN                                 0x0
#define _PID1CON_MODE0_POSITION                             0x0
#define _PID1CON_MODE0_SIZE                                 0x1
#define _PID1CON_MODE0_LENGTH                               0x1
#define _PID1CON_MODE0_MASK                                 0x1
#define _PID1CON_MODE1_POSN                                 0x1
#define _PID1CON_MODE1_POSITION                             0x1
#define _PID1CON_MODE1_SIZE                                 0x1
#define _PID1CON_MODE1_LENGTH                               0x1
#define _PID1CON_MODE1_MASK                                 0x2
#define _PID1CON_MODE2_POSN                                 0x2
#define _PID1CON_MODE2_POSITION                             0x2
#define _PID1CON_MODE2_SIZE                                 0x1
#define _PID1CON_MODE2_LENGTH                               0x1
#define _PID1CON_MODE2_MASK                                 0x4
#define _PID1CON_PID1MODE0_POSN                             0x0
#define _PID1CON_PID1MODE0_POSITION                         0x0
#define _PID1CON_PID1MODE0_SIZE                             0x1
#define _PID1CON_PID1MODE0_LENGTH                           0x1
#define _PID1CON_PID1MODE0_MASK                             0x1
#define _PID1CON_PID1MODE1_POSN                             0x1
#define _PID1CON_PID1MODE1_POSITION                         0x1
#define _PID1CON_PID1MODE1_SIZE                             0x1
#define _PID1CON_PID1MODE1_LENGTH                           0x1
#define _PID1CON_PID1MODE1_MASK                             0x2
#define _PID1CON_PID1MODE2_POSN                             0x2
#define _PID1CON_PID1MODE2_POSITION                         0x2
#define _PID1CON_PID1MODE2_SIZE                             0x1
#define _PID1CON_PID1MODE2_LENGTH                           0x1
#define _PID1CON_PID1MODE2_MASK                             0x4

// Register: PWM3DC
#define PWM3DC PWM3DC
extern volatile unsigned short          PWM3DC              __at(0x617);
#ifndef _LIB_BUILD
asm("PWM3DC equ 0617h");
#endif

