MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1619/mcu.h
extern volatile CRCACCHbits_t CRCACCHbits __at(0x794);
// bitfield macros
#define _CRCACCH_ACC_POSN                                   0x0
#define _CRCACCH_ACC_POSITION                               0x0
#define _CRCACCH_ACC_SIZE                                   0x8
#define _CRCACCH_ACC_LENGTH                                 0x8
#define _CRCACCH_ACC_MASK                                   0xFF
#define _CRCACCH_ACC8_POSN                                  0x0
#define _CRCACCH_ACC8_POSITION                              0x0
#define _CRCACCH_ACC8_SIZE                                  0x1
#define _CRCACCH_ACC8_LENGTH                                0x1
#define _CRCACCH_ACC8_MASK                                  0x1
#define _CRCACCH_ACC9_POSN                                  0x1
#define _CRCACCH_ACC9_POSITION                              0x1
#define _CRCACCH_ACC9_SIZE                                  0x1
#define _CRCACCH_ACC9_LENGTH                                0x1
#define _CRCACCH_ACC9_MASK                                  0x2
#define _CRCACCH_ACC10_POSN                                 0x2
#define _CRCACCH_ACC10_POSITION                             0x2
#define _CRCACCH_ACC10_SIZE                                 0x1
#define _CRCACCH_ACC10_LENGTH                               0x1
#define _CRCACCH_ACC10_MASK                                 0x4
#define _CRCACCH_ACC11_POSN                                 0x3
#define _CRCACCH_ACC11_POSITION                             0x3
#define _CRCACCH_ACC11_SIZE                                 0x1
#define _CRCACCH_ACC11_LENGTH                               0x1
#define _CRCACCH_ACC11_MASK                                 0x8
#define _CRCACCH_ACC12_POSN                                 0x4
#define _CRCACCH_ACC12_POSITION                             0x4
#define _CRCACCH_ACC12_SIZE                                 0x1
#define _CRCACCH_ACC12_LENGTH                               0x1
#define _CRCACCH_ACC12_MASK                                 0x10
#define _CRCACCH_ACC13_POSN                                 0x5
#define _CRCACCH_ACC13_POSITION                             0x5
#define _CRCACCH_ACC13_SIZE                                 0x1
#define _CRCACCH_ACC13_LENGTH                               0x1
#define _CRCACCH_ACC13_MASK                                 0x20
#define _CRCACCH_ACC14_POSN                                 0x6
#define _CRCACCH_ACC14_POSITION                             0x6
#define _CRCACCH_ACC14_SIZE                                 0x1
#define _CRCACCH_ACC14_LENGTH                               0x1
#define _CRCACCH_ACC14_MASK                                 0x40
#define _CRCACCH_ACC15_POSN                                 0x7
#define _CRCACCH_ACC15_POSITION                             0x7
#define _CRCACCH_ACC15_SIZE                                 0x1
#define _CRCACCH_ACC15_LENGTH                               0x1
#define _CRCACCH_ACC15_MASK                                 0x80
#define _CRCACCH_CRCACC_POSN                                0x0
#define _CRCACCH_CRCACC_POSITION                            0x0
#define _CRCACCH_CRCACC_SIZE                                0x8
#define _CRCACCH_CRCACC_LENGTH                              0x8
#define _CRCACCH_CRCACC_MASK                                0xFF
#define _CRCACCH_CRCACC8_POSN                               0x0
#define _CRCACCH_CRCACC8_POSITION                           0x0
#define _CRCACCH_CRCACC8_SIZE                               0x1
#define _CRCACCH_CRCACC8_LENGTH                             0x1
#define _CRCACCH_CRCACC8_MASK                               0x1
#define _CRCACCH_CRCACC9_POSN                               0x1
#define _CRCACCH_CRCACC9_POSITION                           0x1
#define _CRCACCH_CRCACC9_SIZE                               0x1
#define _CRCACCH_CRCACC9_LENGTH                             0x1
#define _CRCACCH_CRCACC9_MASK                               0x2
#define _CRCACCH_CRCACC10_POSN                              0x2
#define _CRCACCH_CRCACC10_POSITION                          0x2
#define _CRCACCH_CRCACC10_SIZE                              0x1
#define _CRCACCH_CRCACC10_LENGTH                            0x1
#define _CRCACCH_CRCACC10_MASK                              0x4
#define _CRCACCH_CRCACC11_POSN                              0x3
#define _CRCACCH_CRCACC11_POSITION                          0x3
#define _CRCACCH_CRCACC11_SIZE                              0x1
#define _CRCACCH_CRCACC11_LENGTH                            0x1
#define _CRCACCH_CRCACC11_MASK                              0x8
#define _CRCACCH_CRCACC12_POSN                              0x4
#define _CRCACCH_CRCACC12_POSITION                          0x4
#define _CRCACCH_CRCACC12_SIZE                              0x1
#define _CRCACCH_CRCACC12_LENGTH                            0x1
#define _CRCACCH_CRCACC12_MASK                              0x10
#define _CRCACCH_CRCACC13_POSN                              0x5
#define _CRCACCH_CRCACC13_POSITION                          0x5
#define _CRCACCH_CRCACC13_SIZE                              0x1
#define _CRCACCH_CRCACC13_LENGTH                            0x1
#define _CRCACCH_CRCACC13_MASK                              0x20
#define _CRCACCH_CRCACC14_POSN                              0x6
#define _CRCACCH_CRCACC14_POSITION                          0x6
#define _CRCACCH_CRCACC14_SIZE                              0x1
#define _CRCACCH_CRCACC14_LENGTH                            0x1
#define _CRCACCH_CRCACC14_MASK                              0x40
#define _CRCACCH_CRCACC15_POSN                              0x7
#define _CRCACCH_CRCACC15_POSITION                          0x7
#define _CRCACCH_CRCACC15_SIZE                              0x1
#define _CRCACCH_CRCACC15_LENGTH                            0x1
#define _CRCACCH_CRCACC15_MASK                              0x80

// Register: CRCSHIFT
#define CRCSHIFT CRCSHIFT
extern volatile unsigned short          CRCSHIFT            __at(0x795);
#ifndef _LIB_BUILD
asm("CRCSHIFT equ 0795h");
#endif

// Register: CRCSHIFTL
#define CRCSHIFTL CRCSHIFTL
extern volatile unsigned char           CRCSHIFTL           __at(0x795);
#ifndef _LIB_BUILD
asm("CRCSHIFTL equ 0795h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SHIFT                  :8;
    };
    struct {
        unsigned SHIFT0                 :1;
        unsigned SHIFT1                 :1;
        unsigned SHIFT2                 :1;
        unsigned SHIFT3                 :1;
        unsigned SHIFT4                 :1;
        unsigned SHIFT5                 :1;
        unsigned SHIFT6                 :1;
        unsigned SHIFT7                 :1;
    };
    struct {
        unsigned CRCSHIFT               :8;
    };
    struct {
        unsigned CRCSHIFT0              :1;
        unsigned CRCSHIFT1              :1;
        unsigned CRCSHIFT2              :1;
        unsigned CRCSHIFT3              :1;
        unsigned CRCSHIFT4              :1;
        unsigned CRCSHIFT5              :1;
        unsigned CRCSHIFT6              :1;
        unsigned CRCSHIFT7              :1;
    };
} CRCSHIFTLbits_t;
extern volatile CRCSHIFTLbits_t CRCSHIFTLbits __at(0x795);
// bitfield macros
#define _CRCSHIFTL_SHIFT_POSN                               0x0
#define _CRCSHIFTL_SHIFT_POSITION                           0x0
#define _CRCSHIFTL_SHIFT_SIZE                               0x8
#define _CRCSHIFTL_SHIFT_LENGTH                             0x8
#define _CRCSHIFTL_SHIFT_MASK                               0xFF
#define _CRCSHIFTL_SHIFT0_POSN                              0x0
#define _CRCSHIFTL_SHIFT0_POSITION                          0x0
#define _CRCSHIFTL_SHIFT0_SIZE                              0x1
#define _CRCSHIFTL_SHIFT0_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT0_MASK                              0x1
#define _CRCSHIFTL_SHIFT1_POSN                              0x1
#define _CRCSHIFTL_SHIFT1_POSITION                          0x1
#define _CRCSHIFTL_SHIFT1_SIZE                              0x1
#define _CRCSHIFTL_SHIFT1_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT1_MASK                              0x2
#define _CRCSHIFTL_SHIFT2_POSN                              0x2
#define _CRCSHIFTL_SHIFT2_POSITION                          0x2
#define _CRCSHIFTL_SHIFT2_SIZE                              0x1
#define _CRCSHIFTL_SHIFT2_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT2_MASK                              0x4
#define _CRCSHIFTL_SHIFT3_POSN                              0x3
#define _CRCSHIFTL_SHIFT3_POSITION                          0x3
#define _CRCSHIFTL_SHIFT3_SIZE                              0x1
#define _CRCSHIFTL_SHIFT3_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT3_MASK                              0x8
#define _CRCSHIFTL_SHIFT4_POSN                              0x4
#define _CRCSHIFTL_SHIFT4_POSITION                          0x4
#define _CRCSHIFTL_SHIFT4_SIZE                              0x1
#define _CRCSHIFTL_SHIFT4_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT4_MASK                              0x10
#define _CRCSHIFTL_SHIFT5_POSN                              0x5
#define _CRCSHIFTL_SHIFT5_POSITION                          0x5
#define _CRCSHIFTL_SHIFT5_SIZE                              0x1
#define _CRCSHIFTL_SHIFT5_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT5_MASK                              0x20
#define _CRCSHIFTL_SHIFT6_POSN                              0x6
#define _CRCSHIFTL_SHIFT6_POSITION                          0x6
#define _CRCSHIFTL_SHIFT6_SIZE                              0x1
#define _CRCSHIFTL_SHIFT6_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT6_MASK                              0x40
#define _CRCSHIFTL_SHIFT7_POSN                              0x7
#define _CRCSHIFTL_SHIFT7_POSITION                          0x7
#define _CRCSHIFTL_SHIFT7_SIZE                              0x1
#define _CRCSHIFTL_SHIFT7_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT7_MASK                              0x80
#define _CRCSHIFTL_CRCSHIFT_POSN                            0x0
#define _CRCSHIFTL_CRCSHIFT_POSITION                        0x0
#define _CRCSHIFTL_CRCSHIFT_SIZE                            0x8
#define _CRCSHIFTL_CRCSHIFT_LENGTH                          0x8
#define _CRCSHIFTL_CRCSHIFT_MASK                            0xFF
#define _CRCSHIFTL_CRCSHIFT0_POSN                           0x0
#define _CRCSHIFTL_CRCSHIFT0_POSITION                       0x0
#define _CRCSHIFTL_CRCSHIFT0_SIZE                           0x1
#define _CRCSHIFTL_CRCSHIFT0_LENGTH                         0x1
#define _CRCSHIFTL_CRCSHIFT0_MASK                           0x1
#define _CRCSHIFTL_CRCSHIFT1_POSN                           0x1
#define _CRCSHIFTL_CRCSHIFT1_POSITION                       0x1
#define _CRCSHIFTL_CRCSHIFT1_SIZE                           0x1
#define _CRCSHIFTL_CRCSHIFT1_LENGTH                         0x1
#define _CRCSHIFTL_CRCSHIFT1_MASK                           0x2
#define _CRCSHIFTL_CRCSHIFT2_POSN                           0x2
#define _CRCSHIFTL_CRCSHIFT2_POSITION                       0x2
#define _CRCSHIFTL_CRCSHIFT2_SIZE                           0x1
#define _CRCSHIFTL_CRCSHIFT2_LENGTH                         0x1
#define _CRCSHIFTL_CRCSHIFT2_MASK                           0x4
#define _CRCSHIFTL_CRCSHIFT3_POSN                           0x3
#define _CRCSHIFTL_CRCSHIFT3_POSITION                       0x3
#define _CRCSHIFTL_CRCSHIFT3_SIZE                           0x1
#define _CRCSHIFTL_CRCSHIFT3_LENGTH                         0x1
#define _CRCSHIFTL_CRCSHIFT3_MASK                           0x8
#define _CRCSHIFTL_CRCSHIFT4_POSN                           0x4
#define _CRCSHIFTL_CRCSHIFT4_POSITION                       0x4
#define _CRCSHIFTL_CRCSHIFT4_SIZE                           0x1
#define _CRCSHIFTL_CRCSHIFT4_LENGTH                         0x1
#define _CRCSHIFTL_CRCSHIFT4_MASK                           0x10
#define _CRCSHIFTL_CRCSHIFT5_POSN                           0x5
#define _CRCSHIFTL_CRCSHIFT5_POSITION                       0x5
#define _CRCSHIFTL_CRCSHIFT5_SIZE                           0x1
#define _CRCSHIFTL_CRCSHIFT5_LENGTH                         0x1
#define _CRCSHIFTL_CRCSHIFT5_MASK                           0x20
#define _CRCSHIFTL_CRCSHIFT6_POSN                           0x6
#define _CRCSHIFTL_CRCSHIFT6_POSITION                       0x6
#define _CRCSHIFTL_CRCSHIFT6_SIZE                           0x1
#define _CRCSHIFTL_CRCSHIFT6_LENGTH                         0x1
#define _CRCSHIFTL_CRCSHIFT6_MASK                           0x40
#define _CRCSHIFTL_CRCSHIFT7_POSN                           0x7
#define _CRCSHIFTL_CRCSHIFT7_POSITION                       0x7
#define _CRCSHIFTL_CRCSHIFT7_SIZE                           0x1
#define _CRCSHIFTL_CRCSHIFT7_LENGTH                         0x1
#define _CRCSHIFTL_CRCSHIFT7_MASK                           0x80

