MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1619/mcu.h
// PID1OUTLH<OUT10>
extern volatile __bit                   OUT10               __at(0x2CBA);	// @ (0x597 * 8 + 2)
#define                                 OUT10_bit           _BIT_ACCESS(PID1OUTLH,2)
// PID1OUTLH<OUT11>
extern volatile __bit                   OUT11               __at(0x2CBB);	// @ (0x597 * 8 + 3)
#define                                 OUT11_bit           _BIT_ACCESS(PID1OUTLH,3)
// PID1OUTLH<OUT12>
extern volatile __bit                   OUT12               __at(0x2CBC);	// @ (0x597 * 8 + 4)
#define                                 OUT12_bit           _BIT_ACCESS(PID1OUTLH,4)
// PID1OUTLH<OUT13>
extern volatile __bit                   OUT13               __at(0x2CBD);	// @ (0x597 * 8 + 5)
#define                                 OUT13_bit           _BIT_ACCESS(PID1OUTLH,5)
// PID1OUTLH<OUT14>
extern volatile __bit                   OUT14               __at(0x2CBE);	// @ (0x597 * 8 + 6)
#define                                 OUT14_bit           _BIT_ACCESS(PID1OUTLH,6)
// PID1OUTLH<OUT15>
extern volatile __bit                   OUT15               __at(0x2CBF);	// @ (0x597 * 8 + 7)
#define                                 OUT15_bit           _BIT_ACCESS(PID1OUTLH,7)
// PID1OUTHL<OUT16>
extern volatile __bit                   OUT16               __at(0x2CC0);	// @ (0x598 * 8 + 0)
#define                                 OUT16_bit           _BIT_ACCESS(PID1OUTHL,0)
// PID1OUTHL<OUT17>
extern volatile __bit                   OUT17               __at(0x2CC1);	// @ (0x598 * 8 + 1)
#define                                 OUT17_bit           _BIT_ACCESS(PID1OUTHL,1)
// PID1OUTHL<OUT18>
extern volatile __bit                   OUT18               __at(0x2CC2);	// @ (0x598 * 8 + 2)
#define                                 OUT18_bit           _BIT_ACCESS(PID1OUTHL,2)
// PID1OUTHL<OUT19>
extern volatile __bit                   OUT19               __at(0x2CC3);	// @ (0x598 * 8 + 3)
#define                                 OUT19_bit           _BIT_ACCESS(PID1OUTHL,3)
// PID1OUTLL<OUT2>
extern volatile __bit                   OUT2                __at(0x2CB2);	// @ (0x596 * 8 + 2)
#define                                 OUT2_bit            _BIT_ACCESS(PID1OUTLL,2)
// PID1OUTHL<OUT20>
extern volatile __bit                   OUT20               __at(0x2CC4);	// @ (0x598 * 8 + 4)
#define                                 OUT20_bit           _BIT_ACCESS(PID1OUTHL,4)
// PID1OUTHL<OUT21>
extern volatile __bit                   OUT21               __at(0x2CC5);	// @ (0x598 * 8 + 5)
#define                                 OUT21_bit           _BIT_ACCESS(PID1OUTHL,5)
// PID1OUTHL<OUT22>
extern volatile __bit                   OUT22               __at(0x2CC6);	// @ (0x598 * 8 + 6)
#define                                 OUT22_bit           _BIT_ACCESS(PID1OUTHL,6)
// PID1OUTHL<OUT23>
extern volatile __bit                   OUT23               __at(0x2CC7);	// @ (0x598 * 8 + 7)
#define                                 OUT23_bit           _BIT_ACCESS(PID1OUTHL,7)
// PID1OUTHH<OUT24>
extern volatile __bit                   OUT24               __at(0x2CC8);	// @ (0x599 * 8 + 0)
#define                                 OUT24_bit           _BIT_ACCESS(PID1OUTHH,0)
// PID1OUTHH<OUT25>
extern volatile __bit                   OUT25               __at(0x2CC9);	// @ (0x599 * 8 + 1)
#define                                 OUT25_bit           _BIT_ACCESS(PID1OUTHH,1)
// PID1OUTHH<OUT26>
extern volatile __bit                   OUT26               __at(0x2CCA);	// @ (0x599 * 8 + 2)
#define                                 OUT26_bit           _BIT_ACCESS(PID1OUTHH,2)
// PID1OUTHH<OUT27>
extern volatile __bit                   OUT27               __at(0x2CCB);	// @ (0x599 * 8 + 3)
#define                                 OUT27_bit           _BIT_ACCESS(PID1OUTHH,3)
// PID1OUTHH<OUT28>
extern volatile __bit                   OUT28               __at(0x2CCC);	// @ (0x599 * 8 + 4)
#define                                 OUT28_bit           _BIT_ACCESS(PID1OUTHH,4)
// PID1OUTHH<OUT29>
extern volatile __bit                   OUT29               __at(0x2CCD);	// @ (0x599 * 8 + 5)
#define                                 OUT29_bit           _BIT_ACCESS(PID1OUTHH,5)
// PID1OUTLL<OUT3>
extern volatile __bit                   OUT3                __at(0x2CB3);	// @ (0x596 * 8 + 3)
#define                                 OUT3_bit            _BIT_ACCESS(PID1OUTLL,3)
// PID1OUTHH<OUT30>
extern volatile __bit                   OUT30               __at(0x2CCE);	// @ (0x599 * 8 + 6)
#define                                 OUT30_bit           _BIT_ACCESS(PID1OUTHH,6)
// PID1OUTHH<OUT31>
extern volatile __bit                   OUT31               __at(0x2CCF);	// @ (0x599 * 8 + 7)
#define                                 OUT31_bit           _BIT_ACCESS(PID1OUTHH,7)
// PID1OUTU<OUT32>
extern volatile __bit                   OUT32               __at(0x2CD0);	// @ (0x59A * 8 + 0)
#define                                 OUT32_bit           _BIT_ACCESS(PID1OUTU,0)
// PID1OUTU<OUT33>
extern volatile __bit                   OUT33               __at(0x2CD1);	// @ (0x59A * 8 + 1)
#define                                 OUT33_bit           _BIT_ACCESS(PID1OUTU,1)
// PID1OUTU<OUT34>
extern volatile __bit                   OUT34               __at(0x2CD2);	// @ (0x59A * 8 + 2)
#define                                 OUT34_bit           _BIT_ACCESS(PID1OUTU,2)
// PID1OUTU<OUT35>
extern volatile __bit                   OUT35               __at(0x2CD3);	// @ (0x59A * 8 + 3)
#define                                 OUT35_bit           _BIT_ACCESS(PID1OUTU,3)
// PID1OUTLL<OUT4>
extern volatile __bit                   OUT4                __at(0x2CB4);	// @ (0x596 * 8 + 4)
#define                                 OUT4_bit            _BIT_ACCESS(PID1OUTLL,4)
// PID1OUTLL<OUT5>
extern volatile __bit                   OUT5                __at(0x2CB5);	// @ (0x596 * 8 + 5)
#define                                 OUT5_bit            _BIT_ACCESS(PID1OUTLL,5)
// PID1OUTLL<OUT6>
extern volatile __bit                   OUT6                __at(0x2CB6);	// @ (0x596 * 8 + 6)
#define                                 OUT6_bit            _BIT_ACCESS(PID1OUTLL,6)
// PID1OUTLL<OUT7>
extern volatile __bit                   OUT7                __at(0x2CB7);	// @ (0x596 * 8 + 7)
#define                                 OUT7_bit            _BIT_ACCESS(PID1OUTLL,7)
// PID1OUTLH<OUT8>
extern volatile __bit                   OUT8                __at(0x2CB8);	// @ (0x597 * 8 + 0)
#define                                 OUT8_bit            _BIT_ACCESS(PID1OUTLH,0)
// PID1OUTLH<OUT9>
extern volatile __bit                   OUT9                __at(0x2CB9);	// @ (0x597 * 8 + 1)
#define                                 OUT9_bit            _BIT_ACCESS(PID1OUTLH,1)
// CWG1OCON0<OVRA>
extern volatile __bit                   OVRA                __at(0x34AC);	// @ (0x695 * 8 + 4)
#define                                 OVRA_bit            _BIT_ACCESS(CWG1OCON0,4)
// CWG1OCON0<OVRB>
extern volatile __bit                   OVRB                __at(0x34AD);	// @ (0x695 * 8 + 5)
#define                                 OVRB_bit            _BIT_ACCESS(CWG1OCON0,5)
// CWG1OCON0<OVRC>
extern volatile __bit                   OVRC                __at(0x34AE);	// @ (0x695 * 8 + 6)
#define                                 OVRC_bit            _BIT_ACCESS(CWG1OCON0,6)
// CWG1OCON0<OVRD>
extern volatile __bit                   OVRD                __at(0x34AF);	// @ (0x695 * 8 + 7)
#define                                 OVRD_bit            _BIT_ACCESS(CWG1OCON0,7)
// CCPTMRS<P3TSEL0>
extern volatile __bit                   P3TSEL0             __at(0x14F4);	// @ (0x29E * 8 + 4)
#define                                 P3TSEL0_bit         _BIT_ACCESS(CCPTMRS,4)
// CCPTMRS<P3TSEL1>
extern volatile __bit                   P3TSEL1             __at(0x14F5);	// @ (0x29E * 8 + 5)
#define                                 P3TSEL1_bit         _BIT_ACCESS(CCPTMRS,5)
// CCPTMRS<P4TSEL0>
extern volatile __bit                   P4TSEL0             __at(0x14F6);	// @ (0x29E * 8 + 6)
#define                                 P4TSEL0_bit         _BIT_ACCESS(CCPTMRS,6)
// CCPTMRS<P4TSEL1>
extern volatile __bit                   P4TSEL1             __at(0x14F7);	// @ (0x29E * 8 + 7)
#define                                 P4TSEL1_bit         _BIT_ACCESS(CCPTMRS,7)
// SSP1CON3<PCIE>
extern volatile __bit                   PCIE                __at(0x10BE);	// @ (0x217 * 8 + 6)
#define                                 PCIE_bit            _BIT_ACCESS(SSP1CON3,6)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN>
extern volatile __bit                   PEN                 __at(0x10B2);	// @ (0x216 * 8 + 2)
#define                                 PEN_bit             _BIT_ACCESS(SSP1CON2,2)
// AT1PERL<PER0>
extern volatile __bit                   PER0                __at(0x4080);	// @ (0x810 * 8 + 0)
#define                                 PER0_bit            _BIT_ACCESS(AT1PERL,0)
// AT1PERL<PER1>
extern volatile __bit                   PER1                __at(0x4081);	// @ (0x810 * 8 + 1)
#define                                 PER1_bit            _BIT_ACCESS(AT1PERL,1)
// AT1PERH<PER10>
extern volatile __bit                   PER10               __at(0x408A);	// @ (0x811 * 8 + 2)
#define                                 PER10_bit           _BIT_ACCESS(AT1PERH,2)
// AT1PERH<PER11>
extern volatile __bit                   PER11               __at(0x408B);	// @ (0x811 * 8 + 3)
#define                                 PER11_bit           _BIT_ACCESS(AT1PERH,3)
// AT1PERH<PER12>
extern volatile __bit                   PER12               __at(0x408C);	// @ (0x811 * 8 + 4)
#define                                 PER12_bit           _BIT_ACCESS(AT1PERH,4)
// AT1PERH<PER13>
extern volatile __bit                   PER13               __at(0x408D);	// @ (0x811 * 8 + 5)
#define                                 PER13_bit           _BIT_ACCESS(AT1PERH,5)
// AT1PERH<PER14>
extern volatile __bit                   PER14               __at(0x408E);	// @ (0x811 * 8 + 6)
#define                                 PER14_bit           _BIT_ACCESS(AT1PERH,6)
// AT1PERH<PER15>
extern volatile __bit                   PER15               __at(0x408F);	// @ (0x811 * 8 + 7)
#define                                 PER15_bit           _BIT_ACCESS(AT1PERH,7)
// AT1PERL<PER2>
extern volatile __bit                   PER2                __at(0x4082);	// @ (0x810 * 8 + 2)
#define                                 PER2_bit            _BIT_ACCESS(AT1PERL,2)
// AT1PERL<PER3>
extern volatile __bit                   PER3                __at(0x4083);	// @ (0x810 * 8 + 3)
#define                                 PER3_bit            _BIT_ACCESS(AT1PERL,3)
// AT1PERL<PER4>
extern volatile __bit                   PER4                __at(0x4084);	// @ (0x810 * 8 + 4)
#define                                 PER4_bit            _BIT_ACCESS(AT1PERL,4)
// AT1PERL<PER5>
extern volatile __bit                   PER5                __at(0x4085);	// @ (0x810 * 8 + 5)
#define                                 PER5_bit            _BIT_ACCESS(AT1PERL,5)
// AT1PERL<PER6>
extern volatile __bit                   PER6                __at(0x4086);	// @ (0x810 * 8 + 6)
#define                                 PER6_bit            _BIT_ACCESS(AT1PERL,6)
// AT1PERL<PER7>
extern volatile __bit                   PER7                __at(0x4087);	// @ (0x810 * 8 + 7)
#define                                 PER7_bit            _BIT_ACCESS(AT1PERL,7)
// AT1PERH<PER8>
extern volatile __bit                   PER8                __at(0x4088);	// @ (0x811 * 8 + 0)
#define                                 PER8_bit            _BIT_ACCESS(AT1PERH,0)
// AT1PERH<PER9>
extern volatile __bit                   PER9                __at(0x4089);	// @ (0x811 * 8 + 1)
#define                                 PER9_bit            _BIT_ACCESS(AT1PERH,1)
// AT1PERH<PERH0>
extern volatile __bit                   PERH0               __at(0x4088);	// @ (0x811 * 8 + 0)
#define                                 PERH0_bit           _BIT_ACCESS(AT1PERH,0)
// AT1PERH<PERH1>
extern volatile __bit                   PERH1               __at(0x4089);	// @ (0x811 * 8 + 1)
#define                                 PERH1_bit           _BIT_ACCESS(AT1PERH,1)
// AT1PERH<PERH2>
extern volatile __bit                   PERH2               __at(0x408A);	// @ (0x811 * 8 + 2)
#define                                 PERH2_bit           _BIT_ACCESS(AT1PERH,2)
// AT1PERH<PERH3>
extern volatile __bit                   PERH3               __at(0x408B);	// @ (0x811 * 8 + 3)
#define                                 PERH3_bit           _BIT_ACCESS(AT1PERH,3)
// AT1PERH<PERH4>
extern volatile __bit                   PERH4               __at(0x408C);	// @ (0x811 * 8 + 4)
#define                                 PERH4_bit           _BIT_ACCESS(AT1PERH,4)
// AT1PERH<PERH5>
extern volatile __bit                   PERH5               __at(0x408D);	// @ (0x811 * 8 + 5)
#define                                 PERH5_bit           _BIT_ACCESS(AT1PERH,5)
// AT1PERH<PERH6>
extern volatile __bit                   PERH6               __at(0x408E);	// @ (0x811 * 8 + 6)
#define                                 PERH6_bit           _BIT_ACCESS(AT1PERH,6)
// AT1PERH<PERH7>
extern volatile __bit                   PERH7               __at(0x408F);	// @ (0x811 * 8 + 7)
#define                                 PERH7_bit           _BIT_ACCESS(AT1PERH,7)
// AT1PERL<PERL0>
extern volatile __bit                   PERL0               __at(0x4080);	// @ (0x810 * 8 + 0)
#define                                 PERL0_bit           _BIT_ACCESS(AT1PERL,0)
// AT1PERL<PERL1>
extern volatile __bit                   PERL1               __at(0x4081);	// @ (0x810 * 8 + 1)
#define                                 PERL1_bit           _BIT_ACCESS(AT1PERL,1)
// AT1PERL<PERL2>
extern volatile __bit                   PERL2               __at(0x4082);	// @ (0x810 * 8 + 2)
#define                                 PERL2_bit           _BIT_ACCESS(AT1PERL,2)
// AT1PERL<PERL3>
extern volatile __bit                   PERL3               __at(0x4083);	// @ (0x810 * 8 + 3)
#define                                 PERL3_bit           _BIT_ACCESS(AT1PERL,3)
// AT1PERL<PERL4>
extern volatile __bit                   PERL4               __at(0x4084);	// @ (0x810 * 8 + 4)
#define                                 PERL4_bit           _BIT_ACCESS(AT1PERL,4)
// AT1PERL<PERL5>
extern volatile __bit                   PERL5               __at(0x4085);	// @ (0x810 * 8 + 5)
#define                                 PERL5_bit           _BIT_ACCESS(AT1PERL,5)
// AT1PERL<PERL6>
extern volatile __bit                   PERL6               __at(0x4086);	// @ (0x810 * 8 + 6)
#define                                 PERL6_bit           _BIT_ACCESS(AT1PERL,6)
// AT1PERL<PERL7>
extern volatile __bit                   PERL7               __at(0x4087);	// @ (0x810 * 8 + 7)
#define                                 PERL7_bit           _BIT_ACCESS(AT1PERL,7)
// AT1CON1<PHP>
extern volatile __bit                   PHP                 __at(0x40AE);	// @ (0x815 * 8 + 6)
#define                                 PHP_bit             _BIT_ACCESS(AT1CON1,6)
// AT1PHSL<PHS0>
extern volatile __bit                   PHS0                __at(0x4090);	// @ (0x812 * 8 + 0)
#define                                 PHS0_bit            _BIT_ACCESS(AT1PHSL,0)
// AT1PHSL<PHS1>
extern volatile __bit                   PHS1                __at(0x4091);	// @ (0x812 * 8 + 1)
#define                                 PHS1_bit            _BIT_ACCESS(AT1PHSL,1)
// AT1PHSL<PHS2>
extern volatile __bit                   PHS2                __at(0x4092);	// @ (0x812 * 8 + 2)
#define                                 PHS2_bit            _BIT_ACCESS(AT1PHSL,2)
// AT1PHSL<PHS3>
extern volatile __bit                   PHS3                __at(0x4093);	// @ (0x812 * 8 + 3)
#define                                 PHS3_bit            _BIT_ACCESS(AT1PHSL,3)
// AT1PHSL<PHS4>
extern volatile __bit                   PHS4                __at(0x4094);	// @ (0x812 * 8 + 4)
#define                                 PHS4_bit            _BIT_ACCESS(AT1PHSL,4)
// AT1PHSL<PHS5>
extern volatile __bit                   PHS5                __at(0x4095);	// @ (0x812 * 8 + 5)
#define                                 PHS5_bit            _BIT_ACCESS(AT1PHSL,5)
// AT1PHSL<PHS6>
extern volatile __bit                   PHS6                __at(0x4096);	// @ (0x812 * 8 + 6)
#define                                 PHS6_bit            _BIT_ACCESS(AT1PHSL,6)
// AT1PHSL<PHS7>
extern volatile __bit                   PHS7                __at(0x4097);	// @ (0x812 * 8 + 7)
#define                                 PHS7_bit            _BIT_ACCESS(AT1PHSL,7)
// AT1PHSH<PHS8>
extern volatile __bit                   PHS8                __at(0x4098);	// @ (0x813 * 8 + 0)
#define                                 PHS8_bit            _BIT_ACCESS(AT1PHSH,0)
// AT1PHSH<PHS9>
extern volatile __bit                   PHS9                __at(0x4099);	// @ (0x813 * 8 + 1)
#define                                 PHS9_bit            _BIT_ACCESS(AT1PHSH,1)
// AT1PHSH<PHSL8>
extern volatile __bit                   PHSL8               __at(0x4098);	// @ (0x813 * 8 + 0)
#define                                 PHSL8_bit           _BIT_ACCESS(AT1PHSH,0)
// AT1PHSH<PHSL9>
extern volatile __bit                   PHSL9               __at(0x4099);	// @ (0x813 * 8 + 1)
#define                                 PHSL9_bit           _BIT_ACCESS(AT1PHSH,1)
// PID1ACCLL<PID1ACC0>
extern volatile __bit                   PID1ACC0            __at(0x3078);	// @ (0x60F * 8 + 0)
#define                                 PID1ACC0_bit        _BIT_ACCESS(PID1ACCLL,0)
// PID1ACCLL<PID1ACC1>
extern volatile __bit                   PID1ACC1            __at(0x3079);	// @ (0x60F * 8 + 1)
#define                                 PID1ACC1_bit        _BIT_ACCESS(PID1ACCLL,1)
// PID1ACCLH<PID1ACC10>
extern volatile __bit                   PID1ACC10           __at(0x3082);	// @ (0x610 * 8 + 2)
#define                                 PID1ACC10_bit       _BIT_ACCESS(PID1ACCLH,2)
// PID1ACCLH<PID1ACC11>
extern volatile __bit                   PID1ACC11           __at(0x3083);	// @ (0x610 * 8 + 3)
#define                                 PID1ACC11_bit       _BIT_ACCESS(PID1ACCLH,3)
// PID1ACCLH<PID1ACC12>
extern volatile __bit                   PID1ACC12           __at(0x3084);	// @ (0x610 * 8 + 4)
#define                                 PID1ACC12_bit       _BIT_ACCESS(PID1ACCLH,4)
// PID1ACCLH<PID1ACC13>
extern volatile __bit                   PID1ACC13           __at(0x3085);	// @ (0x610 * 8 + 5)
#define                                 PID1ACC13_bit       _BIT_ACCESS(PID1ACCLH,5)
// PID1ACCLH<PID1ACC14>
extern volatile __bit                   PID1ACC14           __at(0x3086);	// @ (0x610 * 8 + 6)
#define                                 PID1ACC14_bit       _BIT_ACCESS(PID1ACCLH,6)
// PID1ACCLH<PID1ACC15>
extern volatile __bit                   PID1ACC15           __at(0x3087);	// @ (0x610 * 8 + 7)
#define                                 PID1ACC15_bit       _BIT_ACCESS(PID1ACCLH,7)
// PID1ACCHL<PID1ACC16>
extern volatile __bit                   PID1ACC16           __at(0x3088);	// @ (0x611 * 8 + 0)
#define                                 PID1ACC16_bit       _BIT_ACCESS(PID1ACCHL,0)
// PID1ACCHL<PID1ACC17>
extern volatile __bit                   PID1ACC17           __at(0x3089);	// @ (0x611 * 8 + 1)
#define                                 PID1ACC17_bit       _BIT_ACCESS(PID1ACCHL,1)
// PID1ACCHL<PID1ACC18>
extern volatile __bit                   PID1ACC18           __at(0x308A);	// @ (0x611 * 8 + 2)
#define                                 PID1ACC18_bit       _BIT_ACCESS(PID1ACCHL,2)
// PID1ACCHL<PID1ACC19>
extern volatile __bit                   PID1ACC19           __at(0x308B);	// @ (0x611 * 8 + 3)
#define                                 PID1ACC19_bit       _BIT_ACCESS(PID1ACCHL,3)
// PID1ACCLL<PID1ACC2>
extern volatile __bit                   PID1ACC2            __at(0x307A);	// @ (0x60F * 8 + 2)
#define                                 PID1ACC2_bit        _BIT_ACCESS(PID1ACCLL,2)
// PID1ACCHL<PID1ACC20>
extern volatile __bit                   PID1ACC20           __at(0x308C);	// @ (0x611 * 8 + 4)
#define                                 PID1ACC20_bit       _BIT_ACCESS(PID1ACCHL,4)
// PID1ACCHL<PID1ACC21>
extern volatile __bit                   PID1ACC21           __at(0x308D);	// @ (0x611 * 8 + 5)
#define                                 PID1ACC21_bit       _BIT_ACCESS(PID1ACCHL,5)
// PID1ACCHL<PID1ACC22>
extern volatile __bit                   PID1ACC22           __at(0x308E);	// @ (0x611 * 8 + 6)
#define                                 PID1ACC22_bit       _BIT_ACCESS(PID1ACCHL,6)
// PID1ACCHL<PID1ACC23>
extern volatile __bit                   PID1ACC23           __at(0x308F);	// @ (0x611 * 8 + 7)
#define                                 PID1ACC23_bit       _BIT_ACCESS(PID1ACCHL,7)
// PID1ACCHH<PID1ACC24>
extern volatile __bit                   PID1ACC24           __at(0x3090);	// @ (0x612 * 8 + 0)
#define                                 PID1ACC24_bit       _BIT_ACCESS(PID1ACCHH,0)
// PID1ACCHH<PID1ACC25>
extern volatile __bit                   PID1ACC25           __at(0x3091);	// @ (0x612 * 8 + 1)
#define                                 PID1ACC25_bit       _BIT_ACCESS(PID1ACCHH,1)
// PID1ACCHH<PID1ACC26>
extern volatile __bit                   PID1ACC26           __at(0x3092);	// @ (0x612 * 8 + 2)
#define                                 PID1ACC26_bit       _BIT_ACCESS(PID1ACCHH,2)
// PID1ACCHH<PID1ACC27>
extern volatile __bit                   PID1ACC27           __at(0x3093);	// @ (0x612 * 8 + 3)
#define                                 PID1ACC27_bit       _BIT_ACCESS(PID1ACCHH,3)
// PID1ACCHH<PID1ACC28>
extern volatile __bit                   PID1ACC28           __at(0x3094);	// @ (0x612 * 8 + 4)
#define                                 PID1ACC28_bit       _BIT_ACCESS(PID1ACCHH,4)
// PID1ACCHH<PID1ACC29>
extern volatile __bit                   PID1ACC29           __at(0x3095);	// @ (0x612 * 8 + 5)
#define                                 PID1ACC29_bit       _BIT_ACCESS(PID1ACCHH,5)
// PID1ACCLL<PID1ACC3>
extern volatile __bit                   PID1ACC3            __at(0x307B);	// @ (0x60F * 8 + 3)
#define                                 PID1ACC3_bit        _BIT_ACCESS(PID1ACCLL,3)
// PID1ACCHH<PID1ACC30>
extern volatile __bit                   PID1ACC30           __at(0x3096);	// @ (0x612 * 8 + 6)
#define                                 PID1ACC30_bit       _BIT_ACCESS(PID1ACCHH,6)
// PID1ACCHH<PID1ACC31>
extern volatile __bit                   PID1ACC31           __at(0x3097);	// @ (0x612 * 8 + 7)
#define                                 PID1ACC31_bit       _BIT_ACCESS(PID1ACCHH,7)
// PID1ACCU<PID1ACC32>
extern volatile __bit                   PID1ACC32           __at(0x3098);	// @ (0x613 * 8 + 0)
#define                                 PID1ACC32_bit       _BIT_ACCESS(PID1ACCU,0)
// PID1ACCU<PID1ACC33>
extern volatile __bit                   PID1ACC33           __at(0x3099);	// @ (0x613 * 8 + 1)
#define                                 PID1ACC33_bit       _BIT_ACCESS(PID1ACCU,1)
// PID1ACCU<PID1ACC34>
extern volatile __bit                   PID1ACC34           __at(0x309A);	// @ (0x613 * 8 + 2)
#define                                 PID1ACC34_bit       _BIT_ACCESS(PID1ACCU,2)
// PID1ACCLL<PID1ACC4>
extern volatile __bit                   PID1ACC4            __at(0x307C);	// @ (0x60F * 8 + 4)
#define                                 PID1ACC4_bit        _BIT_ACCESS(PID1ACCLL,4)
// PID1ACCLL<PID1ACC5>
extern volatile __bit                   PID1ACC5            __at(0x307D);	// @ (0x60F * 8 + 5)
