MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1619/mcu.h
extern volatile __bit                   PID1SET14           __at(0x2C6E);	// @ (0x58D * 8 + 6)
#define                                 PID1SET14_bit       _BIT_ACCESS(PID1SETH,6)
// PID1SETH<PID1SET15>
extern volatile __bit                   PID1SET15           __at(0x2C6F);	// @ (0x58D * 8 + 7)
#define                                 PID1SET15_bit       _BIT_ACCESS(PID1SETH,7)
// PID1SETL<PID1SET2>
extern volatile __bit                   PID1SET2            __at(0x2C62);	// @ (0x58C * 8 + 2)
#define                                 PID1SET2_bit        _BIT_ACCESS(PID1SETL,2)
// PID1SETL<PID1SET3>
extern volatile __bit                   PID1SET3            __at(0x2C63);	// @ (0x58C * 8 + 3)
#define                                 PID1SET3_bit        _BIT_ACCESS(PID1SETL,3)
// PID1SETL<PID1SET4>
extern volatile __bit                   PID1SET4            __at(0x2C64);	// @ (0x58C * 8 + 4)
#define                                 PID1SET4_bit        _BIT_ACCESS(PID1SETL,4)
// PID1SETL<PID1SET5>
extern volatile __bit                   PID1SET5            __at(0x2C65);	// @ (0x58C * 8 + 5)
#define                                 PID1SET5_bit        _BIT_ACCESS(PID1SETL,5)
// PID1SETL<PID1SET6>
extern volatile __bit                   PID1SET6            __at(0x2C66);	// @ (0x58C * 8 + 6)
#define                                 PID1SET6_bit        _BIT_ACCESS(PID1SETL,6)
// PID1SETL<PID1SET7>
extern volatile __bit                   PID1SET7            __at(0x2C67);	// @ (0x58C * 8 + 7)
#define                                 PID1SET7_bit        _BIT_ACCESS(PID1SETL,7)
// PID1SETH<PID1SET8>
extern volatile __bit                   PID1SET8            __at(0x2C68);	// @ (0x58D * 8 + 0)
#define                                 PID1SET8_bit        _BIT_ACCESS(PID1SETH,0)
// PID1SETH<PID1SET9>
extern volatile __bit                   PID1SET9            __at(0x2C69);	// @ (0x58D * 8 + 1)
#define                                 PID1SET9_bit        _BIT_ACCESS(PID1SETH,1)
// PID1Z1L<PID1Z10>
extern volatile __bit                   PID1Z10             __at(0x2CD8);	// @ (0x59B * 8 + 0)
#define                                 PID1Z10_bit         _BIT_ACCESS(PID1Z1L,0)
// PID1Z1L<PID1Z11>
extern volatile __bit                   PID1Z11             __at(0x2CD9);	// @ (0x59B * 8 + 1)
#define                                 PID1Z11_bit         _BIT_ACCESS(PID1Z1L,1)
// PID1Z1H<PID1Z110>
extern volatile __bit                   PID1Z110            __at(0x2CE2);	// @ (0x59C * 8 + 2)
#define                                 PID1Z110_bit        _BIT_ACCESS(PID1Z1H,2)
// PID1Z1H<PID1Z111>
extern volatile __bit                   PID1Z111            __at(0x2CE3);	// @ (0x59C * 8 + 3)
#define                                 PID1Z111_bit        _BIT_ACCESS(PID1Z1H,3)
// PID1Z1H<PID1Z112>
extern volatile __bit                   PID1Z112            __at(0x2CE4);	// @ (0x59C * 8 + 4)
#define                                 PID1Z112_bit        _BIT_ACCESS(PID1Z1H,4)
// PID1Z1H<PID1Z113>
extern volatile __bit                   PID1Z113            __at(0x2CE5);	// @ (0x59C * 8 + 5)
#define                                 PID1Z113_bit        _BIT_ACCESS(PID1Z1H,5)
// PID1Z1H<PID1Z114>
extern volatile __bit                   PID1Z114            __at(0x2CE6);	// @ (0x59C * 8 + 6)
#define                                 PID1Z114_bit        _BIT_ACCESS(PID1Z1H,6)
// PID1Z1H<PID1Z115>
extern volatile __bit                   PID1Z115            __at(0x2CE7);	// @ (0x59C * 8 + 7)
#define                                 PID1Z115_bit        _BIT_ACCESS(PID1Z1H,7)
// PID1Z1U<PID1Z116>
extern volatile __bit                   PID1Z116            __at(0x2CE8);	// @ (0x59D * 8 + 0)
#define                                 PID1Z116_bit        _BIT_ACCESS(PID1Z1U,0)
// PID1Z1L<PID1Z12>
extern volatile __bit                   PID1Z12             __at(0x2CDA);	// @ (0x59B * 8 + 2)
#define                                 PID1Z12_bit         _BIT_ACCESS(PID1Z1L,2)
// PID1Z1L<PID1Z13>
extern volatile __bit                   PID1Z13             __at(0x2CDB);	// @ (0x59B * 8 + 3)
#define                                 PID1Z13_bit         _BIT_ACCESS(PID1Z1L,3)
// PID1Z1L<PID1Z14>
extern volatile __bit                   PID1Z14             __at(0x2CDC);	// @ (0x59B * 8 + 4)
#define                                 PID1Z14_bit         _BIT_ACCESS(PID1Z1L,4)
// PID1Z1L<PID1Z15>
extern volatile __bit                   PID1Z15             __at(0x2CDD);	// @ (0x59B * 8 + 5)
#define                                 PID1Z15_bit         _BIT_ACCESS(PID1Z1L,5)
// PID1Z1L<PID1Z16>
extern volatile __bit                   PID1Z16             __at(0x2CDE);	// @ (0x59B * 8 + 6)
#define                                 PID1Z16_bit         _BIT_ACCESS(PID1Z1L,6)
// PID1Z1L<PID1Z17>
extern volatile __bit                   PID1Z17             __at(0x2CDF);	// @ (0x59B * 8 + 7)
#define                                 PID1Z17_bit         _BIT_ACCESS(PID1Z1L,7)
// PID1Z1H<PID1Z18>
extern volatile __bit                   PID1Z18             __at(0x2CE0);	// @ (0x59C * 8 + 0)
#define                                 PID1Z18_bit         _BIT_ACCESS(PID1Z1H,0)
// PID1Z1H<PID1Z19>
extern volatile __bit                   PID1Z19             __at(0x2CE1);	// @ (0x59C * 8 + 1)
#define                                 PID1Z19_bit         _BIT_ACCESS(PID1Z1H,1)
// PID1Z2L<PID1Z20>
extern volatile __bit                   PID1Z20             __at(0x3060);	// @ (0x60C * 8 + 0)
#define                                 PID1Z20_bit         _BIT_ACCESS(PID1Z2L,0)
// PID1Z2L<PID1Z21>
extern volatile __bit                   PID1Z21             __at(0x3061);	// @ (0x60C * 8 + 1)
#define                                 PID1Z21_bit         _BIT_ACCESS(PID1Z2L,1)
// PID1Z2H<PID1Z210>
extern volatile __bit                   PID1Z210            __at(0x306A);	// @ (0x60D * 8 + 2)
#define                                 PID1Z210_bit        _BIT_ACCESS(PID1Z2H,2)
// PID1Z2H<PID1Z211>
extern volatile __bit                   PID1Z211            __at(0x306B);	// @ (0x60D * 8 + 3)
#define                                 PID1Z211_bit        _BIT_ACCESS(PID1Z2H,3)
// PID1Z2H<PID1Z212>
extern volatile __bit                   PID1Z212            __at(0x306C);	// @ (0x60D * 8 + 4)
#define                                 PID1Z212_bit        _BIT_ACCESS(PID1Z2H,4)
// PID1Z2H<PID1Z213>
extern volatile __bit                   PID1Z213            __at(0x306D);	// @ (0x60D * 8 + 5)
#define                                 PID1Z213_bit        _BIT_ACCESS(PID1Z2H,5)
// PID1Z2H<PID1Z214>
extern volatile __bit                   PID1Z214            __at(0x306E);	// @ (0x60D * 8 + 6)
#define                                 PID1Z214_bit        _BIT_ACCESS(PID1Z2H,6)
// PID1Z2H<PID1Z215>
extern volatile __bit                   PID1Z215            __at(0x306F);	// @ (0x60D * 8 + 7)
#define                                 PID1Z215_bit        _BIT_ACCESS(PID1Z2H,7)
// PID1Z2U<PID1Z216>
extern volatile __bit                   PID1Z216            __at(0x3070);	// @ (0x60E * 8 + 0)
#define                                 PID1Z216_bit        _BIT_ACCESS(PID1Z2U,0)
// PID1Z2L<PID1Z22>
extern volatile __bit                   PID1Z22             __at(0x3062);	// @ (0x60C * 8 + 2)
#define                                 PID1Z22_bit         _BIT_ACCESS(PID1Z2L,2)
// PID1Z2L<PID1Z23>
extern volatile __bit                   PID1Z23             __at(0x3063);	// @ (0x60C * 8 + 3)
#define                                 PID1Z23_bit         _BIT_ACCESS(PID1Z2L,3)
// PID1Z2L<PID1Z24>
extern volatile __bit                   PID1Z24             __at(0x3064);	// @ (0x60C * 8 + 4)
#define                                 PID1Z24_bit         _BIT_ACCESS(PID1Z2L,4)
// PID1Z2L<PID1Z25>
extern volatile __bit                   PID1Z25             __at(0x3065);	// @ (0x60C * 8 + 5)
#define                                 PID1Z25_bit         _BIT_ACCESS(PID1Z2L,5)
// PID1Z2L<PID1Z26>
extern volatile __bit                   PID1Z26             __at(0x3066);	// @ (0x60C * 8 + 6)
#define                                 PID1Z26_bit         _BIT_ACCESS(PID1Z2L,6)
// PID1Z2L<PID1Z27>
extern volatile __bit                   PID1Z27             __at(0x3067);	// @ (0x60C * 8 + 7)
#define                                 PID1Z27_bit         _BIT_ACCESS(PID1Z2L,7)
// PID1Z2H<PID1Z28>
extern volatile __bit                   PID1Z28             __at(0x3068);	// @ (0x60D * 8 + 0)
#define                                 PID1Z28_bit         _BIT_ACCESS(PID1Z2H,0)
// PID1Z2H<PID1Z29>
extern volatile __bit                   PID1Z29             __at(0x3069);	// @ (0x60D * 8 + 1)
#define                                 PID1Z29_bit         _BIT_ACCESS(PID1Z2H,1)
// CRCCON1<PLEN0>
extern volatile __bit                   PLEN0               __at(0x3CD0);	// @ (0x79A * 8 + 0)
#define                                 PLEN0_bit           _BIT_ACCESS(CRCCON1,0)
// CRCCON1<PLEN1>
extern volatile __bit                   PLEN1               __at(0x3CD1);	// @ (0x79A * 8 + 1)
#define                                 PLEN1_bit           _BIT_ACCESS(CRCCON1,1)
// CRCCON1<PLEN2>
extern volatile __bit                   PLEN2               __at(0x3CD2);	// @ (0x79A * 8 + 2)
#define                                 PLEN2_bit           _BIT_ACCESS(CRCCON1,2)
// CRCCON1<PLEN3>
extern volatile __bit                   PLEN3               __at(0x3CD3);	// @ (0x79A * 8 + 3)
#define                                 PLEN3_bit           _BIT_ACCESS(CRCCON1,3)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x4D6);	// @ (0x9A * 8 + 6)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,6)
// CWG1CON1<POLA>
extern volatile __bit                   POLA                __at(0x34B8);	// @ (0x697 * 8 + 0)
#define                                 POLA_bit            _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<POLB>
extern volatile __bit                   POLB                __at(0x34B9);	// @ (0x697 * 8 + 1)
#define                                 POLB_bit            _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<POLC>
extern volatile __bit                   POLC                __at(0x34BA);	// @ (0x697 * 8 + 2)
#define                                 POLC_bit            _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<POLD>
extern volatile __bit                   POLD                __at(0x34BB);	// @ (0x697 * 8 + 3)
#define                                 POLD_bit            _BIT_ACCESS(CWG1CON1,3)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0x7078);	// @ (0xE0F * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// AT1CON0<PREC>
extern volatile __bit                   PREC                __at(0x40A6);	// @ (0x814 * 8 + 6)
#define                                 PREC_bit            _BIT_ACCESS(AT1CON0,6)
// AT1CON1<PRP>
extern volatile __bit                   PRP                 __at(0x40AC);	// @ (0x815 * 8 + 4)
#define                                 PRP_bit             _BIT_ACCESS(AT1CON1,4)
// OPTION_REG<PS2>
extern volatile __bit                   PS2                 __at(0x4AA);	// @ (0x95 * 8 + 2)
#define                                 PS2_bit             _BIT_ACCESS(OPTION_REG,2)
// OPTION_REG<PSA>
extern volatile __bit                   PSA                 __at(0x4AB);	// @ (0x95 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(OPTION_REG,3)
// WDTPSL<PSCNT0>
extern volatile __bit                   PSCNT0              __at(0x3898);	// @ (0x713 * 8 + 0)
#define                                 PSCNT0_bit          _BIT_ACCESS(WDTPSL,0)
// WDTPSL<PSCNT1>
extern volatile __bit                   PSCNT1              __at(0x3899);	// @ (0x713 * 8 + 1)
#define                                 PSCNT1_bit          _BIT_ACCESS(WDTPSL,1)
// WDTPSH<PSCNT10>
extern volatile __bit                   PSCNT10             __at(0x38A2);	// @ (0x714 * 8 + 2)
#define                                 PSCNT10_bit         _BIT_ACCESS(WDTPSH,2)
// WDTPSH<PSCNT11>
extern volatile __bit                   PSCNT11             __at(0x38A3);	// @ (0x714 * 8 + 3)
#define                                 PSCNT11_bit         _BIT_ACCESS(WDTPSH,3)
// WDTPSH<PSCNT12>
extern volatile __bit                   PSCNT12             __at(0x38A4);	// @ (0x714 * 8 + 4)
#define                                 PSCNT12_bit         _BIT_ACCESS(WDTPSH,4)
// WDTPSH<PSCNT13>
extern volatile __bit                   PSCNT13             __at(0x38A5);	// @ (0x714 * 8 + 5)
#define                                 PSCNT13_bit         _BIT_ACCESS(WDTPSH,5)
// WDTPSH<PSCNT14>
extern volatile __bit                   PSCNT14             __at(0x38A6);	// @ (0x714 * 8 + 6)
#define                                 PSCNT14_bit         _BIT_ACCESS(WDTPSH,6)
// WDTPSH<PSCNT15>
extern volatile __bit                   PSCNT15             __at(0x38A7);	// @ (0x714 * 8 + 7)
#define                                 PSCNT15_bit         _BIT_ACCESS(WDTPSH,7)
// WDTTMR<PSCNT16>
extern volatile __bit                   PSCNT16             __at(0x38A8);	// @ (0x715 * 8 + 0)
#define                                 PSCNT16_bit         _BIT_ACCESS(WDTTMR,0)
// WDTTMR<PSCNT17>
extern volatile __bit                   PSCNT17             __at(0x38A9);	// @ (0x715 * 8 + 1)
#define                                 PSCNT17_bit         _BIT_ACCESS(WDTTMR,1)
// WDTPSL<PSCNT2>
extern volatile __bit                   PSCNT2              __at(0x389A);	// @ (0x713 * 8 + 2)
#define                                 PSCNT2_bit          _BIT_ACCESS(WDTPSL,2)
// WDTPSL<PSCNT3>
extern volatile __bit                   PSCNT3              __at(0x389B);	// @ (0x713 * 8 + 3)
#define                                 PSCNT3_bit          _BIT_ACCESS(WDTPSL,3)
// WDTPSL<PSCNT4>
extern volatile __bit                   PSCNT4              __at(0x389C);	// @ (0x713 * 8 + 4)
#define                                 PSCNT4_bit          _BIT_ACCESS(WDTPSL,4)
// WDTPSL<PSCNT5>
extern volatile __bit                   PSCNT5              __at(0x389D);	// @ (0x713 * 8 + 5)
#define                                 PSCNT5_bit          _BIT_ACCESS(WDTPSL,5)
// WDTPSL<PSCNT6>
extern volatile __bit                   PSCNT6              __at(0x389E);	// @ (0x713 * 8 + 6)
#define                                 PSCNT6_bit          _BIT_ACCESS(WDTPSL,6)
// WDTPSL<PSCNT7>
extern volatile __bit                   PSCNT7              __at(0x389F);	// @ (0x713 * 8 + 7)
#define                                 PSCNT7_bit          _BIT_ACCESS(WDTPSL,7)
// WDTPSH<PSCNT8>
extern volatile __bit                   PSCNT8              __at(0x38A0);	// @ (0x714 * 8 + 0)
#define                                 PSCNT8_bit          _BIT_ACCESS(WDTPSH,0)
// WDTPSH<PSCNT9>
extern volatile __bit                   PSCNT9              __at(0x38A1);	// @ (0x714 * 8 + 1)
#define                                 PSCNT9_bit          _BIT_ACCESS(WDTPSH,1)
// PWM3DCL<PWM3DC0>
extern volatile __bit                   PWM3DC0             __at(0x30BE);	// @ (0x617 * 8 + 6)
#define                                 PWM3DC0_bit         _BIT_ACCESS(PWM3DCL,6)
// PWM3DCL<PWM3DC1>
extern volatile __bit                   PWM3DC1             __at(0x30BF);	// @ (0x617 * 8 + 7)
#define                                 PWM3DC1_bit         _BIT_ACCESS(PWM3DCL,7)
// PWM3DCH<PWM3DC2>
extern volatile __bit                   PWM3DC2             __at(0x30C0);	// @ (0x618 * 8 + 0)
#define                                 PWM3DC2_bit         _BIT_ACCESS(PWM3DCH,0)
// PWM3DCH<PWM3DC3>
extern volatile __bit                   PWM3DC3             __at(0x30C1);	// @ (0x618 * 8 + 1)
#define                                 PWM3DC3_bit         _BIT_ACCESS(PWM3DCH,1)
// PWM3DCH<PWM3DC4>
extern volatile __bit                   PWM3DC4             __at(0x30C2);	// @ (0x618 * 8 + 2)
#define                                 PWM3DC4_bit         _BIT_ACCESS(PWM3DCH,2)
// PWM3DCH<PWM3DC5>
extern volatile __bit                   PWM3DC5             __at(0x30C3);	// @ (0x618 * 8 + 3)
#define                                 PWM3DC5_bit         _BIT_ACCESS(PWM3DCH,3)
// PWM3DCH<PWM3DC6>
extern volatile __bit                   PWM3DC6             __at(0x30C4);	// @ (0x618 * 8 + 4)
#define                                 PWM3DC6_bit         _BIT_ACCESS(PWM3DCH,4)
// PWM3DCH<PWM3DC7>
extern volatile __bit                   PWM3DC7             __at(0x30C5);	// @ (0x618 * 8 + 5)
#define                                 PWM3DC7_bit         _BIT_ACCESS(PWM3DCH,5)
// PWM3DCH<PWM3DC8>
extern volatile __bit                   PWM3DC8             __at(0x30C6);	// @ (0x618 * 8 + 6)
#define                                 PWM3DC8_bit         _BIT_ACCESS(PWM3DCH,6)
// PWM3DCH<PWM3DC9>
extern volatile __bit                   PWM3DC9             __at(0x30C7);	// @ (0x618 * 8 + 7)
#define                                 PWM3DC9_bit         _BIT_ACCESS(PWM3DCH,7)
// PWM3CON<PWM3EN>
extern volatile __bit                   PWM3EN              __at(0x30CF);	// @ (0x619 * 8 + 7)
#define                                 PWM3EN_bit          _BIT_ACCESS(PWM3CON,7)
// PWM3CON<PWM3OUT>
extern volatile __bit                   PWM3OUT             __at(0x30CD);	// @ (0x619 * 8 + 5)
#define                                 PWM3OUT_bit         _BIT_ACCESS(PWM3CON,5)
// PWM3CON<PWM3POL>
extern volatile __bit                   PWM3POL             __at(0x30CC);	// @ (0x619 * 8 + 4)
#define                                 PWM3POL_bit         _BIT_ACCESS(PWM3CON,4)
// PWM4DCL<PWM4DC0>
extern volatile __bit                   PWM4DC0             __at(0x30D6);	// @ (0x61A * 8 + 6)
#define                                 PWM4DC0_bit         _BIT_ACCESS(PWM4DCL,6)
// PWM4DCL<PWM4DC1>
extern volatile __bit                   PWM4DC1             __at(0x30D7);	// @ (0x61A * 8 + 7)
#define                                 PWM4DC1_bit         _BIT_ACCESS(PWM4DCL,7)
// PWM4DCH<PWM4DC2>
extern volatile __bit                   PWM4DC2             __at(0x30D8);	// @ (0x61B * 8 + 0)
#define                                 PWM4DC2_bit         _BIT_ACCESS(PWM4DCH,0)
// PWM4DCH<PWM4DC3>
extern volatile __bit                   PWM4DC3             __at(0x30D9);	// @ (0x61B * 8 + 1)
#define                                 PWM4DC3_bit         _BIT_ACCESS(PWM4DCH,1)
// PWM4DCH<PWM4DC4>
extern volatile __bit                   PWM4DC4             __at(0x30DA);	// @ (0x61B * 8 + 2)
#define                                 PWM4DC4_bit         _BIT_ACCESS(PWM4DCH,2)
// PWM4DCH<PWM4DC5>
extern volatile __bit                   PWM4DC5             __at(0x30DB);	// @ (0x61B * 8 + 3)
#define                                 PWM4DC5_bit         _BIT_ACCESS(PWM4DCH,3)
// PWM4DCH<PWM4DC6>
extern volatile __bit                   PWM4DC6             __at(0x30DC);	// @ (0x61B * 8 + 4)
#define                                 PWM4DC6_bit         _BIT_ACCESS(PWM4DCH,4)
// PWM4DCH<PWM4DC7>
extern volatile __bit                   PWM4DC7             __at(0x30DD);	// @ (0x61B * 8 + 5)
#define                                 PWM4DC7_bit         _BIT_ACCESS(PWM4DCH,5)
// PWM4DCH<PWM4DC8>
extern volatile __bit                   PWM4DC8             __at(0x30DE);	// @ (0x61B * 8 + 6)
#define                                 PWM4DC8_bit         _BIT_ACCESS(PWM4DCH,6)
// PWM4DCH<PWM4DC9>
extern volatile __bit                   PWM4DC9             __at(0x30DF);	// @ (0x61B * 8 + 7)
#define                                 PWM4DC9_bit         _BIT_ACCESS(PWM4DCH,7)
// PWM4CON<PWM4EN>
extern volatile __bit                   PWM4EN              __at(0x30E7);	// @ (0x61C * 8 + 7)
#define                                 PWM4EN_bit          _BIT_ACCESS(PWM4CON,7)
// PWM4CON<PWM4OUT>
extern volatile __bit                   PWM4OUT             __at(0x30E5);	// @ (0x61C * 8 + 5)
#define                                 PWM4OUT_bit         _BIT_ACCESS(PWM4CON,5)
// PWM4CON<PWM4POL>
extern volatile __bit                   PWM4POL             __at(0x30E4);	// @ (0x61C * 8 + 4)
#define                                 PWM4POL_bit         _BIT_ACCESS(PWM4CON,4)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x60);	// @ (0xC * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// RA0PPS<RA0PPS0>
extern volatile __bit                   RA0PPS0             __at(0x7480);	// @ (0xE90 * 8 + 0)
#define                                 RA0PPS0_bit         _BIT_ACCESS(RA0PPS,0)
// RA0PPS<RA0PPS1>
extern volatile __bit                   RA0PPS1             __at(0x7481);	// @ (0xE90 * 8 + 1)
#define                                 RA0PPS1_bit         _BIT_ACCESS(RA0PPS,1)
// RA0PPS<RA0PPS2>
extern volatile __bit                   RA0PPS2             __at(0x7482);	// @ (0xE90 * 8 + 2)
#define                                 RA0PPS2_bit         _BIT_ACCESS(RA0PPS,2)
// RA0PPS<RA0PPS3>
extern volatile __bit                   RA0PPS3             __at(0x7483);	// @ (0xE90 * 8 + 3)
#define                                 RA0PPS3_bit         _BIT_ACCESS(RA0PPS,3)
// RA0PPS<RA0PPS4>
extern volatile __bit                   RA0PPS4             __at(0x7484);	// @ (0xE90 * 8 + 4)
#define                                 RA0PPS4_bit         _BIT_ACCESS(RA0PPS,4)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x61);	// @ (0xC * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// RA1PPS<RA1PPS0>
extern volatile __bit                   RA1PPS0             __at(0x7488);	// @ (0xE91 * 8 + 0)
#define                                 RA1PPS0_bit         _BIT_ACCESS(RA1PPS,0)
// RA1PPS<RA1PPS1>
extern volatile __bit                   RA1PPS1             __at(0x7489);	// @ (0xE91 * 8 + 1)
#define                                 RA1PPS1_bit         _BIT_ACCESS(RA1PPS,1)
// RA1PPS<RA1PPS2>
extern volatile __bit                   RA1PPS2             __at(0x748A);	// @ (0xE91 * 8 + 2)
#define                                 RA1PPS2_bit         _BIT_ACCESS(RA1PPS,2)
// RA1PPS<RA1PPS3>
extern volatile __bit                   RA1PPS3             __at(0x748B);	// @ (0xE91 * 8 + 3)
#define                                 RA1PPS3_bit         _BIT_ACCESS(RA1PPS,3)
// RA1PPS<RA1PPS4>
extern volatile __bit                   RA1PPS4             __at(0x748C);	// @ (0xE91 * 8 + 4)
#define                                 RA1PPS4_bit         _BIT_ACCESS(RA1PPS,4)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x62);	// @ (0xC * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// RA2PPS<RA2PPS0>
extern volatile __bit                   RA2PPS0             __at(0x7490);	// @ (0xE92 * 8 + 0)
#define                                 RA2PPS0_bit         _BIT_ACCESS(RA2PPS,0)
// RA2PPS<RA2PPS1>
extern volatile __bit                   RA2PPS1             __at(0x7491);	// @ (0xE92 * 8 + 1)
#define                                 RA2PPS1_bit         _BIT_ACCESS(RA2PPS,1)
// RA2PPS<RA2PPS2>
extern volatile __bit                   RA2PPS2             __at(0x7492);	// @ (0xE92 * 8 + 2)
#define                                 RA2PPS2_bit         _BIT_ACCESS(RA2PPS,2)
// RA2PPS<RA2PPS3>
extern volatile __bit                   RA2PPS3             __at(0x7493);	// @ (0xE92 * 8 + 3)
#define                                 RA2PPS3_bit         _BIT_ACCESS(RA2PPS,3)
// RA2PPS<RA2PPS4>
extern volatile __bit                   RA2PPS4             __at(0x7494);	// @ (0xE92 * 8 + 4)
#define                                 RA2PPS4_bit         _BIT_ACCESS(RA2PPS,4)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x63);	// @ (0xC * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x64);	// @ (0xC * 8 + 4)
